<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"9c1319e028147c777e572ec32ec851557411534da4aeecc9f681f502c3461523","plan_job_ref":"Job Create MPE Management terraform plan #28 at https://github.com/AFMPE/mpe_management/actions/runs/7292583180","plan_hash":"4b91f1b99bcdca147107330da9ce45b2cc725e599da3757c82b8cdb909727ee7","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 14 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.avset will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "avset" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_availability_set"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.computer_windows will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "computer_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.disk will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "disk" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_managed_disk"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.nic will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.ppg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ppg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_proximity_placement_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.pub_ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "pub_ip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.vm_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_linux" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_linux_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurenoopsutils_resource_name.vm_windows will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "jmp"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurerm_network_security_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ampe-eus-devsecops-prod-vm-nsg"
      + resource_group_name = "ampe-eus-devsecops-prod-rg"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurerm_resource_group.rgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rgrp" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "ampe-eus-devsecops-prod-rg"
      + tags       = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurerm_subnet.snet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-devsecops-prod-vm-snet"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-devsecops-prod-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ampe-eus-devsecops-prod-vnet"
    }

  # module.mod_bastion_jmp_virtual_machine[0].data.azurerm_virtual_network.vnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-devsecops-prod-vnet"
      + resource_group_name     = "ampe-eus-devsecops-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_managed_disk.data_disk["disk1"] will be created
  + resource "azurerm_managed_disk" "data_disk" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 100
      + id                                = (known after apply)
      + location                          = (known after apply)
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = (known after apply)
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ampe-eus-devsecops-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = (known after apply)
      + tier                              = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_interface.nic[0] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = (known after apply)
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-devsecops-prod-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconig-vmnicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_interface_security_group_association.nsgassoc[0] will be created
  + resource "azurerm_network_interface_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_security_rule.nsg_rule["rdp"] will be created
  + resource "azurerm_network_security_rule" "nsg_rule" {
      + access                      = "Allow"
      + description                 = "Inbound_Port_3386"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "3386"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "rdp"
      + network_security_group_name = "ampe-eus-devsecops-prod-vm-nsg"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "ampe-eus-devsecops-prod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_network_security_rule.nsg_rule["ssh"] will be created
  + resource "azurerm_network_security_rule" "nsg_rule" {
      + access                      = "Allow"
      + description                 = "Inbound_Port_22"
      + destination_address_prefix  = (known after apply)
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ssh"
      + network_security_group_name = "ampe-eus-devsecops-prod-vm-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "ampe-eus-devsecops-prod-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_data_disk_attachment.data_disk["disk1"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_bastion_jmp_virtual_machine[0].azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = (known after apply)
      + max_bid_price                                          = -1
      + name                                                   = (known after apply)
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-devsecops-prod-rg"
      + size                                                   = "Standard_B1s"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # module.mod_bastion_jmp_virtual_machine[0].random_id.uniqueString will be created
  + resource "random_id" "uniqueString" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "org_prefix" = "ampe"
          + "subid"      = "jmp"
        }
    }

  # module.mod_devsecops_network.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-ampe-eus-hub-core-prod-vnet-to-devsecops-spoke"
      + remote_virtual_network_id    = "**********************************************************************************************************************************************************************"
      + resource_group_name          = "ampe-eus-hub-core-prod-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "ampe-eus-hub-core-prod-vnet"
    }

  # module.mod_shared_keyvault[0].data.azurenoopsutils_resource_name.keyvault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "keyvault" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "shared-keys"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_shared_keyvault[0].data.azurenoopsutils_resource_name.keyvault_hsm will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "keyvault_hsm" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "shared-keys"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_shared_keyvault[0].data.azurerm_client_config.current_config will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current_config" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_shared_keyvault[0].data.azurerm_private_endpoint_connection.pip[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_private_endpoint_connection" "pip" {
      + id                         = (known after apply)
      + location                   = (known after apply)
      + name                       = (known after apply)
      + network_interface          = (known after apply)
      + private_service_connection = (known after apply)
      + resource_group_name        = "ampe-eus-devsecops-prod-rg"
    }

  # module.mod_shared_keyvault[0].data.azurerm_resource_group.rgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rgrp" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "ampe-eus-devsecops-prod-rg"
      + tags       = (known after apply)
    }

  # module.mod_shared_keyvault[0].data.azurerm_subnet.snet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-devsecops-prod-private-endpoints-snet"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-devsecops-prod-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ampe-eus-devsecops-prod-vnet"
    }

  # module.mod_shared_keyvault[0].data.azurerm_virtual_network.vnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-devsecops-prod-vnet"
      + resource_group_name     = "ampe-eus-devsecops-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault.keyvault[0] will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (known after apply)
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "ampe-eus-devsecops-prod-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "deployedBy"  = "AzureNoOpsTF"
          + "environment" = "public"
          + "workload"    = "shared-keys"
        }
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = [
              + "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-devsecops-prod-vnet/subnets/ampe-eus-devsecops-prod-private-endpoints-snet",
            ]
        }
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault_access_policy.admin_policy["b5c0c042-8317-4222-a16e-55377b7ec32f"] will be created
  + resource "azurerm_key_vault_access_policy" "admin_policy" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Purge",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "************************************"
      + secret_permissions      = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id               = (known after apply)
    }

  # module.mod_shared_keyvault[0].azurerm_private_dns_a_record.a_rec[0] will be created
  + resource "azurerm_private_dns_a_record" "a_rec" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + records             = (known after apply)
      + resource_group_name = "ampe-eus-devsecops-prod-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.vaultcore.azure.net"
    }

  # module.mod_shared_keyvault[0].azurerm_private_endpoint.pep[0] will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = (known after apply)
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ampe-eus-devsecops-prod-rg"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "keyvault-privatelink"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #28](https://github.com/AFMPE/mpe_management/actions/runs/7292583180)